[
    {
        "id": "enterprise-architecture-assessment",
        "listingImageUrl": "ea-assessment-listing.jpg",
        "imageUrl": "ea-assessment.jpeg",
        "title": "Architecture Assessment",
        "description": "Development of an IT roadmap that created confidence in our client’s strategy towards increasing their market advantage.",
        "isFeatured": true,
        "industry": "insurance",
        "client": "Large, Mutual, Commercial Lines P&C Carrier",
        "expertises": [
            "Strategy and Roadmap",
            "Enterprise Architecture",
            "Application & Solution Architecture"
        ],
        "nextClientStoryId": "claims-modernization",
        "nextClientStoryTitle": "Claims Modernization",
        "nextClientStoryDescription": "X by 2 provided strategy, architecture and program leadership for the multi-year implementation of the Guidewire ClaimCenter platform.",
        "content": "<h1>Opportunity<\/h1>\r\n<p>A large, commercial lines property & casualty carrier was falling behind the competitive curve in technological capability and wanted an independent and objective set of perspectives on its IT strategy. The insurer needed to identify and prioritize initiatives that would improve its service to agents and policyholders and increase its competitive differentiation. The insurer had a strategic planning process in place that included a regular review of IT activity; however, the IT department wanted to validate the current IT plan and establish a detailed roadmap to ensure that technology enablers were aligned with business objectives.<\/p>\r\n<p>Additionally, the insurer had begun modernizing legacy systems to respond to business pain points, but had concerns about the modernization path being taken and whether that path led to a sustainable enterprise architecture. Most important, the carrier wanted to ensure that any activity they undertook increased value to policyholders and agents and positioned the company for the future.<\/p>\r\n<h1>Engagement<\/h1>\r\n<p>X by 2 conducted an in-depth enterprise architecture and IT roadmap assessment, engaging with all key constituents across the business to capture the as-is state of core processes, systems, data, technology and architecture. Because users had been reluctant to bring problems directly to IT, having an objective third party was important to obtain unfiltered input from the full user base. This assessment was also combined with market research on competitors’ capabilities, industry best practices and X by 2’s extensive industry experience.<\/p>\r\n<p>Next, X by 2 identified key pain points and capability gaps that involved people, business processes and technology. Key findings included a lack of self-service capabilities, lack of business process automation, functional gaps in core applications and insufficient data access and analysis. As a result, the carrier was experiencing a high cost of service request compared to competitors, while agents and customers dealt with reduced responsiveness and error-prone business processes. This led to an image in the marketplace of being a less technologically advanced carrier, causing the carrier to miss out on revenue opportunity.<\/p>\r\n<p>X by 2’s analysis incorporated an in-depth architecture assessment that validated whether or not areas of the client’s current IT strategy would close these gaps and support targeted business objectives. It prioritized major business and IT initiatives that would improve the company’s competitive position. It also established a future target state for architecture (data, business, application and enterprise) and provided a roadmap for achieving those states. Additionally, the assessment included recommended changes involving people, business processes and IT organization that would enable the client to best achieve its business objectives.<\/p>\r\n<h1>Impact<\/h1>\r\n<p>Due to X by 2’s analysis, the client discovered that it did not have the architecture and technology needed to support business objectives at an enterprise level. In particular, the agent portal was identified as an area where the insurer was significantly behind the competitive curve. The top systems initiatives targeted were modernizing its policy administration and claims system, creating an enterprise portal, developing advanced data analysis, data mining and ad-hoc reporting capabilities.<\/p>\r\n<p>In each of these areas, X by 2 delivered recommendations for solutions that would support the desired future state while also providing scalability and alignment with targeted enterprise architecture objectives. According to the client, a key differentiator in X by 2’s work product was the creation of a detailed, documented and actionable plan for achieving the desired to-be state.<\/p>\r\n<p>The client used X by 2’s objective assessment to make critical changes to IT processes that included modifying roles and responsibilities, elevating the importance of the architectural role and establishing better project communications between business and IT teams.   The analysis was objective and balanced, indicating both the areas where IT activity did not align with best practices or where they were behind peer companies, as well as the areas where IT goals and activity did align with business objectives.<\/p>\r\n<p>Today, the client has a roadmap in place that supports IT strategic planning and serves as a key communication device with the C-level suite to obtain buy-in and budget approval on IT investments. As a result of X by 2’s enterprise architecture assessment, the client has gained confidence in its strategic planning process and has put an IT roadmap in place targeted toward increasing its market advantage.<\/p>\r\n"
    },
    {
        "id": "claims-modernization",
        "listingImageUrl": "claims-modernization-listing.jpg",
        "imageUrl": "claims-modernization.jpeg",
        "title": "Claims Modernization",
        "description": "Strategy, architecture and program leadership for the multi-year implementation of the Guidewire ClaimCenter platform.",
        "isFeatured": true,
        "industry": "insurance",
        "client": "Fortune 500 and Multi-Line Insurer",
        "expertises": [
            "Enterprise Architecture",
            "Strategy and Roadmap",
            "Agile Implementation"
        ],
        "nextClientStoryId": "life-modernization",
        "nextClientStoryTitle": "Life Modernization",
        "nextClientStoryDescription": "X by 2 provided strategy and technical leadership of a core system modernization for the life division of a fortune 500 carrier.",
        "content": "<h1>Opportunity<\/h1>\r\n<p>For insurers, handling claims accurately, efficiently and quickly is essential.  However, this insurer’s legacy claims administration platform was no longer up to the task.  The insurer required a modern claims system to keep up with business changes, reduce loss adjustment expenses and leakage, and streamline the claims adjudication process for their 1,500 claims processors and adjusters that spread across their home office and more than 80 claims branches across the United States. <\/p>\r\n<p>The solution needed to include better management of the claims lifecycle and tasks, improved integration capabilities, better enforcement of business rules, finer-grained data collection and more effective workload and resource management for branch managers.<\/p>\r\n<h1>Engagement<\/h1>\r\n<p>The insurer engaged X by 2 to provide a comprehensive and objective analysis that would lead to choosing the best-fit claims solution for their unique distributed claims organization and business processes.<\/p>\r\n<p>X by 2 performed and facilitated a buy vs. build analysis and recommendation which included a total cost of ownership analysis that eventually led to a decision to buy a new claims system. X by 2 then performed a package evaluation and helped the client select the solution that best fit their business goals, objectives, functional needs and non-functional needs (architecture qualities).<\/p>\r\n<p>X by 2 continued the engagement with our client by helping mobilize the implementation team, developing the initial implementation roadmap and providing overall program, technical and architecture leadership during the implementation and rollout of major lines of business on the new claims system, Guidewire ClaimCenter, including Personal Property, Personal Auto and Commercial Auto.<\/p>\r\n<h1>Impact<\/h1>\r\n<p>X by 2’s objective and thorough analysis of the entire spectrum of options available, including solutions developed using in-house resources and available within the marketplace, helped facilitate a clear and consensus-oriented decision between business and IT stakeholders to embark on replacing the legacy claims system.<\/p>\r\n<p>At the time, the claims modernization program was the largest in scope and size, the most complex and the most strategic IT initiative for the Fortune 500 insurer.  X by 2 provided program, technical and architecture leadership throughout the strategy and successful implementation of the claims modernization journey for the insurer. The implementation and delivery was deemed “best run” and became a model to follow for similar large and strategic initiatives within the insurer’s organization. The implementation of the modern claims platform continues to bear fruit in the form of innovative and strategic business and claims transformation initiatives.<\/p>"
    },
    {
        "id": "life-modernization",
        "listingImageUrl": "life-modernization-listing.jpg",
        "imageUrl": "life-modernization.jpeg",
        "title": "Life Modernization",
        "description": "Successfully led the implementation of a core system modernization effort for the life division of a fortune 500 carrier.",
        "isFeatured": true,
        "industry": "insurance",
        "client": "Fortune 500 and Multi-Line Insurer",
        "expertises": [
            "Enterprise Architecture",
            "Agile Implementation",
            "Application & Solution Architecture"
        ],
        "nextClientStoryId": "data-and-analytics-platform-for-value-based-care",
        "nextClientStoryTitle": "Data and Analytics Platform",
        "nextClientStoryDescription": "X by 2 led the efforts to develop and deliver on strategies for our client’s advanced analytic and reporting capabilities for their value partnership programs.",
        "content": "<h1>Opportunity<\/h1>\r\n\r\n<p>With a goal of five percent annual growth, our client needed to modernize their Life division’s core systems to sustain projected growth. A key aspect of this modernization was to increase process automation and efficiency, due to the expectation of increased customers and service and support processes moving forward. In its current state, this client needed forty-five to sixty days to process an application, an unacceptable amount of time in a rapidly modernizing industry.  Further, a timeline of roughly eighteen to twenty-four months to create new or update existing products in the life division was similarly unacceptable. The market motivation for creating faster and more robust services and processes was to meet customer expectations by enhancing the overall customer experience.  This would be accomplished by reducing the time for processing applications and for creating new products.  The insurer also sought better self-service capabilities for both the customer and agents as part of the modernization.<\/p>\r\n\r\n<h1>Engagement<\/h1>\r\n\r\n<p>The engagement began with a current state business analysis. In completing the analysis, X by 2 highlighted the fact that from a technology perspective the Life company was effectively part of the P&C line of business.  That meant that most of the life business functions were part of larger corporate functions, including the life claims function.  Among other observations, X by 2 identified a completely manual vendor integration process wherein individuals were required to log into vendor websites in order to receive integration requirements.<\/p>\r\n\r\n<p>As part of the current state business analysis, X by 2 identified pain points within the client’s Life division. This identification process covered several areas of the business, including new business and underwriting, policyholder and agent self-service, quoting, among several others. Through system analysis and individual interviews, X by 2 created a list of current state pain points in order to understand what the future state should address. This also led to the creation of a current state technical architecture to document the Life division’s technology operations.  This technical analysis identified the legacy policy system’s many limitations as a result of its home-built legacy Cobol construction and customization.  Additionally, the database in use was sub-optimized by using different schemas for different applications with unique table names for each schema.<\/p>\r\n\r\n<p>After identifying the current state and the associated pain points, X by 2 conducted a buy vs. build analysis of the current market offerings. This process started with a broad evaluation of the market for potential product candidates before diving into a detailed analysis that mapped the client’s functional pain points to a product’s ability to solve them. Other factors analyzed included scalability and maintainability, ease of integration and customization, and total cost of ownership. Following this analysis, X by 2 concluded that the market did not have any good product offerings for the client’s life core system.<\/p>\r\n\r\n<h1>Impact<\/h1>\r\n\r\n<p>After concluding that building a custom solution was the best option for this client – given the current state of the Life product marketplace - X by 2 created a 5 year horizon future state architecture. From there, a detailed implementation roadmap was created, including recommendations on project organization and team structure.  X by 2 successfully led the implementation of the new system and continues to provide leadership for other modernization efforts for the Life division of the carrier. These areas include the creation of agent portals to streamline quoting and application submission, the integration of the Life ODS with internal and external entities, and a reduction in policy issuance timing, all while providing better visibility of the process for agents and policyholders.<\/p>"
    },
    {
        "id": "data-and-analytics-platform-for-value-based-care",
        "listingImageUrl": "data-analytics-listing.jpg",
        "imageUrl": "data-analytics.jpeg",
        "title": "Data and Analytics Platform",
        "description": "Development and delivery on strategies for advanced analytic and reporting capabilities for value partnership programs.",
        "isFeatured": false,
        "industry": "healthcare",
        "client": "Blue Cross Blue Shield Affiliate",
        "expertises": [
            "Data & Integration Architecture",
            "Strategy and Roadmap",
            "Agile Implementation"
        ],
        "nextClientStoryId": "pas-architecture-review",
        "nextClientStoryTitle": "PAS Architecture Review",
        "nextClientStoryDescription": "X by 2 led the architecture review of an in-flight policy administration initiative, focusing on overall architecture and the use of agile methodology.",
        "content": "<h1>Opportunity<\/h1>\r\n<p>As a prominent health plan with a strong reputation, our client’s nationally recognized value partnership and collaborative quality incentives programs - Practitioner Care Medical Home (PCMH) and Provider Group Incentive Program (PGIP) - are leading the way in controlling health care costs and improving health outcomes. In a continuing effort to grow and evolve their programs, X by 2 collaborated with the client and developed advanced medical informatics and reporting capabilities that enabled them to better evaluate the impact of systemic improvements in care processes and more quickly adapt to industry-wide changes that result from health care reform.<\/p>\r\n<p>Through its promotion of a PCMH model, our client worked to dramatically improve care quality, lower costs, increase satisfaction by providing incentives for physicians to focus on the overall health and wellness of each patient, and empower members to take more control of their own health outcomes and costs. The health insurer’s ability to grow its programs; however, had become hindered by its inability to efficiently collect and analyze data for various initiatives.<\/p>\r\n<p>To help maintain its edge and continually evolve the incentive programs, our client required advanced data, analytics and reporting capabilities to enable the identification and evaluation of systemic improvements in care processes.   A key element of this was the measurement of initiative effectiveness from the perspective of results, incentive payout, projected savings and impact on the quality of care.<\/p>\r\n<h1>Engagement<\/h1>\r\n<p>X by 2 led the strategy and development efforts to deliver advanced analytic and reporting capabilities for our client’s value partnership programs. In close collaboration with key business and IT leadership, X by 2 developed a single clinical programs and medical informatics approach that consolidated the insurer’s vast amount of core data related to its incentive programs into a new data mart that enabled streamlined, accurate, and consistent analytic capabilities and reports in just nine months.<\/p> \r\n<p>The platform consolidated core membership, claims and provider data from disparate sources (e.g. Commercial, Medicare Advantage, etc.) into a single repository and automated advanced methods to enable analysts to identify and better understand the relationships between concepts such as:<\/p>\r\n<ul>\r\n<li><b>A Unified Person:<\/b>  identification and tracking of a person’s membership over their lifetime.<\/li>\r\n<li><b>Care Relationship:<\/b>  identification and tracking of a person’s Primary Care Physician (PCP) over their lifetime.<\/li>\r\n<li><b>Encounter:<\/b>  identification of inpatient, emergency, and outpatient encounters and the tracking of a person’s interactions with a health facility. <\/li>\r\n<li><b>Disease Identification:<\/b> using claims history, person concepts and industry standards such as Hierarchical Chronic Condition (HCC) to identify patients with chronic illness.<\/li>\r\n<\/ul><p>Using these concepts X by 2 was able to build provider performance reports such as:<\/p>\r\n<ul><li>Generic drug usage<\/li>\r\n<li>Diabetic patient care<\/li>\r\n<li>Cardiological care for patients<\/li>\r\n<li>Transfer of care between hospital and PCP<\/li>\r\n<\/ul>\r\n<p>As part of the overall strategy and implementation, X by 2 developed an integration strategy for external data and data enrichment sources that included:<\/p>\r\n<ul>\r\n<li>EHR Systems<\/li>\r\n<li>HEDIS Engines<\/li>\r\n<li>Groupers (medical condition episode, clinical risk)<\/li>\r\n<li>Labs (Quest and JVHL)<\/li>\r\n<li>State Immunization Registry<\/li>\r\n<li>EDGE Server<\/li>\r\n<\/ul>\r\n<p>This combination of data allowed our client to more thoroughly evaluate a person’s health experience, holistically view a person’s care ongoing care and create advanced reporting that is shared internally and with providers. These reports are related to evidence-based care, generic prescription dispensing, inpatient use, claims, etc.<\/p>\r\n<h1>Impact<\/h1>\r\n<p>With the implementation of the platform, the health insurer is better equipped to evolve and grow its industry leading physician incentive and PCMH programs with advanced analytics. What X by 2 delivered became the single source for all analytics and reporting for our client’s cross departmental data scientists, statisticians, etc. Additionally, as industry-wide changes continue via health care reform (e.g. performance-based payments), our client will be well-positioned for competitive advantage.<\/p>\r\n"
    },
    {
        "id": "pas-architecture-review",
        "listingImageUrl": "pas-review-listing.jpg",
        "imageUrl": "pas-review.jpg",
        "title": "PAS Architecture Review",
        "description": "Architecture review of an in-flight policy admin initiative, focusing on overall architecture and the use of agile methodology.",
        "isFeatured": false,
        "industry": "insurance",
        "client": "Specialty Lines Subsidiary of Fortune 500 Insurer",
        "expertises": [
            "Project Audit & Review",
            "Agile Implementation",
            "Enterprise Architecture"
        ],
        "nextClientStoryId": "core-system-integration-strategy-and-implementation",
        "nextClientStoryTitle": "Core System Integration",
        "nextClientStoryDescription": "X by 2 provided leadership for the client’s enterprise integration strategy and the development of an Enterprise Service Bus.",
        "content": "<h1>Opportunity<\/h1>\r\n<p>In order to build on its success in an increasingly competitive and time-sensitive market, our client looked to deploy new capabilities to its agents while exploring new channels and market opportunities. The client needed the ability to bring new products to market quickly and efficiently, deliver self-service capabilities to independent agents, position itself for a future move into the direct-to-consumer sales channel and create a platform to enable cross-selling and up-selling across products and lines. <\/p>\r\n<p>Unfortunately, the insurer could not achieve these objectives due to proprietary legacy platforms that prevented the quick response to new market and process opportunities.  As a result, the client needed to convert its entire policy administration platform to a modern architecture, but lacked the internal knowledge to make an accurate technology assessment. Additionally, a highly matrixed organizational structure created the potential for friction among stakeholders, making consensus on key issues difficult to achieve.<\/p>\r\n<p>As the project progressed the client’s IT and project leadership guided the efforts, made changes, and reshaped approaches with the aim of accelerating the launch. The client needed an objective external viewpoint of the project, including a review of the overall architectural approach and its use of the agile development process methodology.<\/p>\r\n<h1>Engagement<\/h1>\r\n<p>X by 2 led the agile architecture review as part of an in-flight policy administration initiative. The review began with an analysis of the overall project that encompassed three major buckets: scope management, team organization and resources, and development process and methodology. Initially, an approach was put in place to establish a breadth-first view of the key project dimensions that identified areas for a deeper review and analysis.<\/p>\r\n<h2>Scope Management Issues and Observations<\/h2>\r\n<p>The client’s use of lengthy use cases created months of review before any software could be created, which elongated the iteration process. This led to problems with testability, communication, coordination and work management. Overall, scope management was not change-friendly due to excessive document creation and rework that became a point of tension between business and IT functions.<\/p>\r\n<h2>Team Structure and Resources Issues and Observations<\/h2>\r\n<p>Design and development on the project was done offshore, leading to the typical challenges surrounding communication, skill sets and time zones. One of the difficulties encountered was a general mismatch of culture in which the offshore partner was used to the parent company’s way of doing things and ‘never said no’ to the client.  Roles were often too fine-grained with narrow responsibilities within the onshore team, and the skills and experience of the onshore and offshore team were not always adequate for the project.  As a result of the X by 2 analysis the client introduced a SWAT approach and implemented elements of collocation in which onshore and offshore team members worked in each other’s physical locations for defined periods of time. This enabled improved communication, including all offshore communication being channeled through one individual for coordination and prioritization.<\/p>\r\n<h2>Development Process and Methodology Issues and Observations<\/h2>\r\n<p>The client lacked clarity on methodology and lacked experience with agile development.  This lack of project clarity led to confusion for both onshore and offshore teams.  The onshore team expected the offshore team to collaborate and work with high-level direction consistent with agile practices; however, the offshore team expected the very detailed specifications of a waterfall approach. This communication disconnect between onshore analysis and offshore development led to significant quality issues and rework. Additionally, there was a misalignment between offshore and onshore teams for Quality Assurance expectations, and there was no single entity that focused on the holistic nature of the final solution from both the business and technology perspectives. These difficulties led to an unmet expectation that there would be a full set of detailed requirements and design documents to continually evolve the system.<\/p>\r\n<h1>Impact<\/h1>\r\n<p>Following the initial analysis period, X by 2 made recommendations to solve the pain points identified. These recommendations provided an objective viewpoint for the client to begin solving issues surrounding overall architectural approach and agile process methodology within their policy administration initiative.<\/p>\r\n<h2>Scope Breakdown and Management Recommendations<\/h2>\r\n<p>To address scope management, X by 2 recommended using business scenario-based use cases rather than screen shots.  The client should shift to smaller iterations that took no longer than 4-8 weeks to produce software, and where practical, interim releases to assess team progress. More broadly, the amount of planning should be reduced and the lean principle of eliminating waste should be applied to invest in value-added planning only. Finally, root causes of failures need to be identified to get business buy-in for a flexible scope, and the business should be allowed to determine priorities.<\/p>\r\n<h2>Team Structure and Resources Recommendation<\/h2>\r\n<p>X by 2 suggested that the client create more coarse-grained team roles and put in place an approach to appropriately credential onshore and offshore resource roles.  Team head-count should be reduced resulting from more coarse-grained roles that lead to smaller teams, helping to reduce communication overhead. This allows the best resources to spend more time actually doing work as opposed to coordinating and communicating. The quality and coordination of architectural solutions could be improved by creating a focused group to ensure the consistent and holistic nature of solutions from both the business and technology perspectives.<\/p>\r\n<h2>Development Process and Methodology Recommendations<\/h2>\r\n<p>The client was advised to create a lighter process for documentation using clear and realistic goals for why process steps or documents were required.  The best practice is to create higher-level and more sustainable artifacts that lead directly to working software, as that is the most important indicator of progress. Acceptance tests need to be created as part of defining and documenting business scenario-based use cases for requirements.<\/p>"
    },
    {
        "id": "core-system-integration-strategy-and-implementation",
        "listingImageUrl": "core-system-integration-listing.jpg",
        "imageUrl": "core-system-integration.jpeg",
        "title": "Core System Integration",
        "description": "Leadership for the execution of an enterprise integration strategy, including the design and development of enterprise services.",
        "isFeatured": false,
        "industry": "healthcare",
        "client": "East Coast-Based and Not-for-Profit Health Insurer",
        "expertises": [
            "Integration Architecture",
            "Data Integration",
            "Project Audit & Review"
        ],
        "content": "<h1>Opportunity<\/h1>\r\n\r\n<p>In order to keep up with the rapidly changing healthcare and health insurance landscape, our client - an east coast not-for-profit health insurer, had three identified goals that pushed them to invest further in their technologies:<\/p>\r\n<ul>\r\n<li>Rank within top 10% of all US companies based on Net Promoter Score<\/li>\r\n<li>Have a 5-star rating for all products<\/li>\r\n<li>Hold premium increases to less than 2% based on total cost of care<\/li>\r\n<\/ul>\r\n<p>Our client needed to replace their consolidated core membership, claims and billing system with a new core system that was able to keep the areas consolidated into one system. X by 2 sought to review and document the high-level current state integration architecture  to provide clarity and an appropriate level of abstraction for the relationships and dependencies between existing enterprise systems, which were a mix of  purchased third-party products and custom developed applications.<\/p>\r\n\r\n<p>As part of the overall enterprise integration strategy and implementation of the new core system, X by 2 helped the client to more effectively and extensively use their Enterprise Service Bus (ESB). X by 2 identified 3-styles of data exchange (batch, synchronous and asynchronous) of which the ESB was to serve as a single location for all synchronous data exchanges. The insurer needed the ESB to eliminate point-to-point integrations and instead move to a hub-and-spoke model in order to improve consistency in the data and maintainability for the applications. These enterprise applications needed to receive data from an Operational Data Store (ODS) through the ESB.<\/p>\r\n\r\n<h1>Engagement<\/h1>\r\n\r\n<p>X by 2 provided technical leadership as part of the execution of the enterprise integration strategy, inclusive of a directional vision for the future state. The envisioned future state included an approach for a federated architecture group with architects from multiple domains creating and implementing architectural standards. X by 2 also made recommendations for better utilizing existing integration tools and utilities along with guidance to improve the client’s integration development capabilities. As part of the core system replacement effort, X by 2 developed a high-level strategy for the near-future and provided integration architecture leadership.<\/p>\r\n\r\n<p>As part of the overall core system integration strategy, X by 2 led the design and development of enterprise services built on top of the ESB utilizing REST API services. The ESB consolidated all synchronous integrations required for the core system replacement and defined the integrations (file to database, messaging, etc.). New service level agreements were created as part of the modernization effort, and X by 2’s ESB design met all standards regarding data quality, accuracy, and retrieval speed when communicating with the ESB.<\/p>\r\n<h1>Impact<\/h1>\r\n\r\n<p>X by 2’s expertise and leadership in our client’s enterprise integration strategy, and development of an Enterprise Service Bus, enabled them to successfully replace their core legacy system while also positioning them for future growth.  As a result of centralizing the location of all enterprise applications data via the ESB, the data quality and consistency was greatly improved.  Further, the design and implementation of the ESB enabled an increase in development speed as developers no longer had to worry about creating individual ODS retrieval mechanisms. The ESB implementation also improved the maintainability of data overall – including problem solving – as a single entity handled all ODS to application interactions.<\/p>\r\n\r\n\r\n"
    }
]