[
	{
        "id": "a-short-guide-to-emerging-website-architectures",
        "title": "A Short Guide to Emerging Website Architectures",
        "authorName": "Jeff Sallans",
        "authorTitle": "Senior Consultant",
        "shortDescription": "X by 2's Jeff Sallans discusses the latest architectural tools designed to create dynamic and interactive mobile experiences for customers. ",
        "isFeatured": false,
        "industry": "insurance",
        "publishDate": "08/02/2017",
        "readTimeInMinutes": 5,
        "publishName": "Becker's Health IT and CIO Review",
        "publishUrl": "https://www.beckershospitalreview.com/healthcare-information-technology/a-short-guide-to-emerging-website-architectures.html",
        "content": "<p><b>EMR1<\/b><br \/>&lt;effectiveTime value=&quot;2015-06-03&quot;&gt;<br \/>&lt;low&gt;&lt;\/low&gt;<br \/>&lt;high&gt;&lt;\/high&gt;<br \/>&lt;\/effectiveTime&gt;<\/p><p><b>EMR2<\/b><br \/>&lt;effectiveTime&gt;<br \/>&lt;low&gt;&lt;\/low&gt;<br \/>&lt;high&gt;&lt;\/high&gt;<br \/>&lt;\/effectiveTime&gt;<\/p><p>It’s no secret that mobile applications and games have upped the ante on the kinds of interactive experiences that customers have come to expect.<\/p>\r\n\r\n<p>Several years ago that front- end experience was limited to relatively static websites that, while rendering useful information and some connectivity, were dull for the customer and tedious for the architect or developer to maintain and update. That has all changed over the past few years, and today’s organizations face intense pressure to create websites and mobile apps that are not only useful but also are intuitive, engaging and interactive. These kinds of experiences for customers – and potential customers – are becoming core to many organizations’ customer service and retention approach, as well as to their branding and messaging appeal. The experiences that a consumer has with an organization’s technological front door are quickly becoming one of the key aspects of acquiring and keeping a customer. With this change in mind a new architecture has been created called MVVM (Model-view-viewmodel):<\/p>\r\n\r\n<img src=\".\\assets\\mind-share-img\\sallans-image-1.jpg\" \/>\r\n\r\n<p>MVVM makes the website’s user experience comparable to that of a mobile application by increasing the speed of navigation and business logic by ten times. This increase is possible because MVVM moves the business logic that previously was coded on the server to the front-end, as shown below. With the majority of the codebase moving to the front-end, architectural tools are being developed to organize large front-end code bases to help maintain code quality. The following illustration highlights the way in which MVVM enables improved user experiences:<\/p>\r\n\r\n<img src=\".\\assets\\mind-share-img\\sallans-image-2.jpg\" \/>\r\n\r\n<p>The rest of this article focuses on two of the architectural frameworks currently available – Angular from Google and React from Facebook – as a way to highlight these front-end technology trends.<\/p>\r\n\r\n<p>The good news is that both Angular and React produce great front-end experiences for customers. However, both frameworks accomplish that differently. That’s important to project managers, tech leads, architects and developers who may be responsible for putting together the best UIX team for their organization.<\/p>\r\n\r\n<p>The Angular framework is better organized for development, despite requiring more coding by the architects and developers. Google has prefabricated the architecture so that most of the work of naming and defining architectural elements for consistency is already done. While there are tradeoffs when it comes to coding versus having to create and define a set of naming conventions, Angular is a more practical and ready-to-use framework in general.<\/p>\r\n\r\n<p>The React framework is less prefabricated, so that means it is better suited for talented developers and architects who don’t mind coding the architectural infrastructure. That work enables more design flexibility and granularity when using React, along with advantages in testing and overall performance. For instance, using React allows the decoupling of the business logic layer from its - or some other subsequent - UI framework. React accomplishes testing through its virtual document object module that helps to make user experience modeling and testing much easier to perform. That said, React is still more of a “framework of a framework” that requires some up-front work than Angular. The following illustration visualizes the capabilities and differences of these new front-ends, and what Angular and React bring to the party respectively:<\/p>\r\n\r\n<img src=\".\\assets\\mind-share-img\\sallans-image-3.jpg\" \/>\r\n\r\n<p>In both cases, there are additional considerations--not the least of which is a learning curve if these frameworks are new to the organization. Both frameworks require practice and patience when it comes to coding and testing to find the best fit for the organization. Both frameworks also require updated infrastructure that might not be in place. Potential new tools and libraries for managing smaller and more numerous bits of JavaScript are but one example.<\/p>\r\n\r\n<p>In the end, most organizations will only need one of these frameworks. If there are already strong architectural skills in place, then React might be the better choice. The depth and breadth of its user experience capabilities, along with a more efficient and effective experience modeling and testing approach, makes React a stronger framework overall. It provides all the necessary tools and capabilities required to create responsive, flexible, and hopefully, retentive front-end customer experiences.<\/p>\r\n",
		"tags": [
            "mobile",
            "application"
        ],
        "nextMindShareId": "avoiding-communication-breakdowns"
    },
	{
        "id": "non-core-system-modernization-matters-too-part-two-contracts-and-implementation",
        "title": "Non-Core Insurance System Modernization Matters Too: Part Two - Contracts & Implementation",
        "authorName": "Priyanga Manoharan",
        "authorTitle": "Senior Architect",
        "shortDescription": "The premise of these articles is to provide a framework that insurers can use to treat their non-core system acquisitions and implementations as if they were core systems, but adjusted for scale and scope.",
        "isFeatured": false,
        "industry": "insurance",
        "publishDate": "08/09/2017",
        "readTimeInMinutes": 5,
        "publishName": "Insurance Innovation Reporter",
        "publishUrl": "http://iireporter.com/non-core-insurance-system-modernization-matters-too-part-two-contracts-implementation/",
        "content": "<p>Part one of this article was a discussion regarding an approach for assessing and analyzing non-core systems (just about anything besides the policy, claims and billing functions) that suggested ways to scale the effort to match the potential benefits derived from the system. This article will focus on two of the other elements necessary for modernizing non-core systems: contracts and implementation. The premise of this installment is to provide a framework that insurers can use to treat their non-core system acquisitions and implementations as if they were core systems, but adjusted for scale and scope.<\/p>\r\n\r\n<p>When it comes to contract negotiations with many of the smaller solution providers that sell and support non-core systems, the good news is that the negotiations are often conducted with the owner or other senior members of the company. This usually means that decisions and changes can be discussed and made more quickly than with larger solution providers. It also means there may be fewer layers of lawyers and procurement managers involved. However, non-core solution providers often have their challenges and nuances, so among other things, it’s important to:<\/p>\r\n\r\n<p><ul><li>Take extra care with the contracts to ensure that appropriate service level agreements have been defined. Many smaller providers have limited resources and can (and will) over-commit to what they can do and how quickly they can do it to close a deal.<\/li>\r\n<li>If the solution provider is hosting or is using a third-party hosting service, then an annual security review ought to be included in the contract beyond the initial review. Cyber liability coverage should be considered as well, either through the solution provided via an addendum in the contract or through an independent insurer specializing in such coverage.<\/li>\r\n<li>The contract should include a copy of the code that can be placed in escrow. This is particularly important for smaller solution providers, who may or may not have the financial wherewithal to stay in business for as long as the insurer uses their product(s). However, obtaining the code doesn’t always mean that standing up an environment to house and protect the code is easy or feasible, so the time it might take to do that should be part of the overall project plan.<\/li>\r\n<li>Including a clearly defined list of functionality and expectations in the contract can also help mitigate the possibility of overselling by any of the vendors. Although it may take a bit of time, it is worth the investment so that the vendor is contractually bound to deliver the functionality.<\/li><\/ul><\/p>\r\n\r\n<p>Implementations for non-core systems follow many of the same best practices as for core systems but with a few tweaks for scale and scope. Practices like leveraging the functionality of the non-core system out of the box to avoid customization and scope creep and avoiding the mistake of comparing the new functionality to any of the incumbent systems (often homegrown) remain valid.  That said, there are some wrinkles to be aware of when implementing non-core systems as follows:<\/p>\r\n\r\n<p><ul><li>Smaller solution providers with multiple clients don’t typically have a deep bench to handle the flow of change requests that always occur once testing begins. Implementation timelines should take into account that the vendor development team is on the critical path.<\/li>\r\n<li>Don’t fall into the trap of attempting to make the non-core system compensate for functionality gaps and shortcomings in the core systems. This is especially important when it comes to data gaps or inconsistent data.<\/li>\r\n<li>Take into account the community using the non-core system. Many will be transitioning directly from older non-core systems, but others may be part of the group already exposed to modern core systems. This comes with the burden of ensuring that the user experience is a comparable one. Wherever possible, have the non-core system users use the new system and core system users stick to their core systems.<\/li>\r\n<li>As a result of not being a core system, reporting and analytics are usually under-developed in many non-core systems. Although the total user group might be small, the impact of processes can be significant if reporting and analytics structures need to be modified for the new system. For example, a premium audit group managing $200M in annual premium can typically recover 1-2 percent per year in premium leakage by using data analytics. If that capability is not immediately available in the new system then the cost it takes to replicate that functionality is more than just the time and resource burn for the technical effort.<\/li>\r\n<li>Similarly, if moving from a paper process to an automated one in the modern non-core system, then expectations have to be created and managed about what functions will be introduced over what period. It can be a fundamental process shift from a reactive analytics and reporting mode (usually paper-based) to a proactive one (usually automated). With the implementation of a modern non-core system, new data points are available, and companies should carefully consider their reporting options.<\/li><\/ul><\/p>\r\n\r\n<p>Finally, and as with modern core systems, good solution providers will take the time to understand the client’s needs and processes prior to any development. This will eliminate the round-peg-into-the-square-hole issue that can occur. If the solution provider is not starting there, then it’s incumbent on the client to begin that process to ensure that the capabilities are mapped to the appropriate business processes. Also, initial releases should be quick and contain as much out of the box as possible. Adjusting or updating the system as it matures with feedback from its actual use will be much more effective than attempting to build a “perfect” system in a whiteboard setting.<\/p>\r\n\r\n<p>Following this suggested approach should benefit the assessment and implementation of any non-core system. While these systems are often in the background and don’t get the same kind of attention and fanfare as modern core systems, they are essential to the ultimate success of any insurer. Part three of this article will focus on post-implementation best practices, including sustaining and maintaining non-core systems in the most efficient and effective ways.<\/p>",
		"tags": [
            "insurance",
            "implementation"
        ],
        "nextMindShareId": "avoiding-communication-breakdowns"
    },
	{
        "id": "avoiding-communication-breakdowns",
        "title": "Avoiding Communication Breakdowns",
        "authorName": "Hatim Kader",
        "authorTitle": "Project Quarterback",
        "shortDescription": "X by 2's Hatim Kader offers experiential and actionable insights on improving the chances for project success by applying the appropriate communications approach.",
        "isFeatured": false,
        "industry": "insurance",
        "publishDate": "08/17/2017",
        "readTimeInMinutes": 5,
        "publishName": "Insurance-Canada",
        "publishUrl": "https://www.insurance-canada.ca/2017/08/17/xby2-communication-breakdowns/",
        "content": "<p>There’s an old real-estate adage that claims the three most important elements in any real estate sale are all the same one: <i>location, location, location<\/i>.  The same can be said for the practice of consulting by replacing the word “location” with the word that represents the most important element of consulting: <b>communication.<\/b><\/p>\r\n\r\n<p>Yes, the technology can be challenging, and yes, understanding the business goals and problems is vitally important, and yes, identifying the best-fit solution with the highest probability of success is key.  But none of these elements mean anything if they are not effectively communicated to the client, project team, solution provider, etc. Many projects have foundered as a result of inefficient and ineffective communications to the key stakeholders.<\/p>\r\n\r\n<p>Communication can take many forms, and it is such a vast and deep subject that after many years of practicing effective communication that I find myself learning and re-learning some of its basics time and time again. This is not to say that effective communication requires a Psychology or Marketing degree either. It just requires some common sense, and more often than not, some persistence.  For instance, anybody who has been a parent, a manager of people, or even in IT, knows that it’s much easier to gain support for an idea or action if the party being communicated to believes that they helped to create said idea or action.<\/p>\r\n\r\n<p>Put another way, it is much easier if the other party believes it to be <i>their<\/i> idea. This is not to suggest that deception, coercion, or even subterfuge be employed.  Rather, it is to suggest that understanding the other party, their perspectives and building a working relationship that’s based on mutual respect and trust helps to create the environment that yields successful outcomes.<\/p>\r\n\r\n<p>In the real world of consulting and project management, it takes some experience to recognize when and where there’s a potential for communication issues. Many times the problem or issue is stark, and the eventual solution is evident; however, there could be other enterprise environmental constraints that influence the decision-making. Often things may seem clear on the surface, but just below the surface, there are obstacles to communicating effectively any proposed solution.  It’s important to work to understand such things. For example, an organization might have some underlying experiences that make committing to a particular solution more difficult.  These experiences could be some of the following:<\/p>\r\n\r\n<p><ul><li>The organization is cautious or averse to solutions they haven’t experienced, like cloud-based applications or storage solutions.<\/li>\r\n<li>There may be push back over concerns of initial and ongoing costs.<\/li>\r\n<li>There may have been prior bad experiences with a particular type of product (ex: COTS solution) or a particular provider.<\/li>\r\n<li>There may be cultural or technical resistance to a proposed solution due to the potential impact on long-held practices and processes.<\/li>\r\n<li>There may be political infighting that prevents progress from occurring.<\/li><\/ul><\/p>\r\n\r\n<p>Where such enterprise environmental constraints might be in play, a quick jump to the conclusion often carries the risk of a good solution proposal being rejected due to the real or imagined constraints. These could lead to lost opportunities for major transformational initiatives with high direct and indirect costs to the organization as a result of misunderstanding and miscommunication of the necessity for and benefits of the proposed solution. Good consultants should make note of such enterprise environmental constraints. As part of their overall strategy for understanding business problems and evaluating best-fit solutions, consultants should also devise strategies for getting their enterprise stakeholders to grasp the problem and assess the proposed solution options.<\/p>\r\n\r\n<p>To avoid this unpleasant but all too common consulting mistake, there are a number of communication approaches that I’ve employed over the years that can help:<\/p>\r\n\r\n<p><ul><li>The deliberative approach. This approach allows time for the problem and its shortcomings to be understood, usually through persistent and understandable communication. It helps the stakeholders to grasp the problems involved fully.  While it may take a little longer, the benefit of this approach is that the stakeholders will discuss solutions naturally and often of their own accord.<\/li>\r\n<li>The team exercise approach. This method involves engaging the stakeholders in exercises that acknowledge the current state, analyze the gaps that need to be remediated to reach the desired future state and discuss potential solutions – technology-based or otherwise.<\/li>\r\n<li>The anticipation approach. This approach involves more than just anticipating questions, a common practice for good consultants.  Rather, this approach requires a deep understanding of the enterprise environmental constraints – technology, resources, budget and revenue, talent, priorities, market pressures, etc. – and preparing and presenting multiple options that challenge those limitations and\/or address those constraints and their relative pros and cons.<\/li><\/ul><\/p>\r\n\r\n<p>These common sense approaches have been around for quite some time, but in the heat of the project battle they are often forgotten or overlooked. The importance of effective communication between all key stakeholders is on the critical path for any successful business technology initiative.  However, even with experience using these techniques as a guide effective communication can be difficult to achieve and maintain.  In my own experience, there are any number of variables that can impact successful communication.  Despite my best efforts as a consultant, I am not always as successful as I’d like to be when establishing communication protocols with clients.  It’s fair to say that sometimes it works better than others, and sometimes a favored approach needs to be abandoned for something else that might prove to be more effective.  The key is to understand the audience, the environment, the constraints, and then to tailor a communication approach that is the best fit for the combination of elements.  The final, most important key is to keep learning.<\/p>",
		"tags": [
            "insurance",
            "communication"
        ],
        "nextMindShareId": "non-core-insurance-system-modernization-matters-too-part-three-sustainability"
    },
	{
        "id": "non-core-insurance-system-modernization-matters-too-part-three-sustainability",
        "title": "Non-Core Insurance System Modernization Matters Too: Part Three - Sustainability",
        "authorName": "Priyanga Manoharan",
        "authorTitle": "Senior Architect",
        "shortDescription": "With proper planning and execution, any insurer’s non-core systems should be humming as well as any of their core systems—perhaps even better.",
        "isFeatured": false,
        "industry": "insurance",
        "publishDate": "09/18/2017",
        "readTimeInMinutes": 5,
        "publishName": "Insurance Innovation Reporter",
        "publishUrl": "http://iireporter.com/non-core-insurance-system-modernization-matters-too-part-three-sustainability/",
        "content": "<p>Parts one and two of this series focused on assessing and implementing non-core systems (defined as just about anything other than policy, claims, and billing systems) that suggested ways to prioritize and scale the efforts required when modernizing non-core systems. This, the third part of the series, focuses on how to overcome the challenges inherent in supporting and maintaining non-core systems post production. As with the first two parts of this article, the premise remains on suggesting a framework that insurers can use to treat their non-core systems as if they were core systems, but adjusted for scale and scope.<\/p>\r\n\r\n<p>The primary problem with maintaining non-core systems after their production implementation is that they are non-core systems and because of that, will never get the priority and resource dedication that core systems typically get. With core systems, there are often large teams of dedicated resources that are committed to the effort for years due to the strategic, operational, and financial importance of the system or systems. This makes perfect sense in an insurance landscape where modern core systems are the table stakes for many of the other innovations and initiatives insurers want and need to take on.<\/p>\r\n\r\n<p>With non-core systems, however, the project teams are not nearly as large and are often disbanded and shifted to higher priority projects just as soon as the non-core system is implemented in production. More often than not the business group is left managing and supporting the system with a skeleton support staff that may not be dedicated to that effort, and may not even include any IT resources.  This often creates a cascade of problems:<\/p>\r\n\r\n<p><ul><li>A business group left to their own devices to manage the newly installed system has other day-to-day priorities, and this reality will inevitably slow down the overall adoption and maturation of the new system.<\/li>\r\n<li>Modernized non-core systems typically introduce new processes and functions to business areas. To get to production, many customers defer some of these enhancements to hasten the delivery of the new system. That creates a post-production backlog of potential enhancements and features that nobody has the time to investigate.<\/li>\r\n<li>That backlog can lead to the system being sub-optimized and therefore unable to deliver the efficiencies it promised. The danger is that since non-core systems generally have a long lifespan, people will just come to accept the system as is, without it reaching its full potential.<\/li>\r\n<li>Since neither IT nor the business has the time and resources to maintain the system, insurers will turn to the vendor for that support. This often makes the problem worse. The vendor may, in fact, work diligently to resolve any issues, but without the proper internal attention required to separate technical problems from process problems, many vendors simply adapt the system to incorporate existing bad processes.<\/li>\r\n<li>This pretty typical cascade of events often results in an overall negative view of the new non-core system by most involved, and that can lead, quite unfortunately, to the insurer never achieving the potential improvements and innovations in effectiveness and efficiencies that modern systems can bring to any company.<\/li><\/ul><\/p>\r\n\r\n<p>That said, there are a few simple steps that insurers can take to avoid the scenarios above for their non-core systems modernization efforts. Employing a little foresight, insurers should plan at the outset for a temporary allocation of business and IT resources post implementation. These resources should be used to form two small teams—one for routine support (upgrades, patches, performance, etc.) and one for focusing on the process and functional impacts of the new system. Depending on the size of the system and the insurer, they may be as small as 2-3 people per team.<\/p>\r\n\r\n<p><b>Roles of Support and Impact Teams<\/b><p>\r\n\r\n<p>While the support team helps to settle the system into production, the impact team should begin the analysis of identifying the process changes that remain, quickly remedying any initial pain points, and prioritizing the enhancements backlog. The impact team can quickly gather the data they need to optimize the system by interviewing new users of the system to identify process opportunities, and by working with the vendor to make sure they’ve fully implemented the latest features of the system. The focus of the impact team is on process improvement first, followed by any technical system changes required to enable the process changes.<\/p>\r\n\r\n<p>One of the biggest benefits of most new systems is the creation and availability of data not previously available. One of the key roles of the impact team is the identification of opportunities where any new data can be put to good use. That’s often in the form of business process improvement and regulatory efficiencies, but there are many other areas where access to new data elements could prove useful and valuable.<\/p>\r\n\r\n<p>Both the impact and support teams should work toward creating a prioritized list of such opportunities. That list should then become part of an ongoing support plan that packages system improvement initiatives into regularly scheduled releases. The releases should be scheduled on a quarterly basis (as opposed to core systems where releases are often deferred for years due to the complexity and the disruption inherent in them) to take advantage of the value of performing incremental improvements on a consistent basis.<\/p>\r\n\r\n<p>Finally, this ongoing support work can be done by a small team, sometimes even ad hoc, that comes together for a couple of weeks each quarter to implement the scheduled release. Resources from the original impact and support teams might be used for this purpose, but it’s not mandatory.<\/p>\r\n\r\n<p>In fact, it’s often the case with non-core systems that after a year or two the system settles in and any functional or technical releases—from the vendor or the insurer—become fewer and farther between. Once any potential enhancements reach the point of diminishing return, many non-core systems can be put into a simple maintain mode until the next modernization cycle begins.<\/p>\r\n\r\n<p>Non-core systems modernization should be an essential part of any insurer’s short and long-term technology plans. With the proper planning and execution, any insurer’s non-core systems should be humming as well as any of their core systems—perhaps even better.<\/p>",
		"tags": [
            "insurance",
            "sustainability"
        ],
        "nextMindShareId": "automating-a-little-can-help-a-lot"
    },
	{
        "id": "automating-a-little-can-help-a-lot",
        "title": "Automating a Little Can Help a Lot",
        "authorName": "David Mitzel",
        "authorTitle": "Architect & Senior Developer",
        "shortDescription": "The reliance on information has become the way that hospitals operate and creating, organizing and optimizing information on a real time basis is an operational imperative for any hospital system.",
        "isFeatured": false,
        "industry": "healthcare",
        "publishDate": "09/01/2017",
        "readTimeInMinutes": 5,
        "publishName": "HIT Leaders & News",
        "publishUrl": "https://us.hitleaders.news/automating-a-little-can-help-a-lot/",
        "content": "<p>Hospitals are nothing if not busy places. Doctors, nurses, patients, families, and support staff make up the human fabric of the daily life at any hospital system. And undergirding all of these stakeholders and activities is another sort of lifeblood for the hospital – data and information. The reliance on information has become the way that hospitals operate, and creating, organizing, and optimizing information on a real time basis is an operational imperative for any hospital system. One of the problems, however, is that hospitals need and use a fair amount of information that they do not create. This article focuses on one of those information streams – the data sent to hospitals from insurance companies – and suggests some best practice approaches for quickly automating the file load process as part of any hospital’s overall data quality improvement efforts.<\/p>\r\n\r\n\r\n<p>The initial process is likely familiar to anybody in a hospital working with data from insurance companies. There are multiple file loads – from dozens to hundreds to thousands – on a daily and monthly basis, sent from a multitude of insurance companies. Somebody, often from the IT group, is tasked with reviewing the files, determining what should and shouldn’t be loaded, firing off the necessary load processes, validating the results, and following up on any files that weren’t received this month or didn’t load successfully. The entire process is laborious and time-consuming, and can easily result in errors. It screams out for an automated solution.<\/p>\r\n\r\n<p>That said, there are challenges that any automated solution needs to address. Chief among the challenges is deciding what can and should be automated, and what can and should be left for operator intervention and decision-making. While automating the entire process is the goal, in some cases, experience and intuition cannot be automated, so a process should be created that allows for an operator to make a judgment on something where appropriate. Another challenge is determining how to handle the multitude of file format and data errors that inevitably occur on a daily basis. Some of the errors are often due to developer mistakes, while others are transmission problems, and still, others are from files that should not be loaded at all, either because they are duplicates, or because they aren’t relevant.<\/p>\r\n\r\n<p>The first step in the automation process is to identify what human operators already know and codify that through enhanced metadata. Operator decisions such as file action (load, archive, ignore, etc.), load process, load frequency, identifying file formats, and many more can all be easily expressed in metadata. From there, a standard and automatic way of responding to data and load errors and exceptions should be determined. This is not just a technical requirement, but also requires the input of those members of the team responsible for communication back to the insurance companies. All of that becomes input for the requirements for developing an automated system that handles incoming files from any and all insurance companies.<\/p>\r\n\r\n<p>Automating file handling in this way will significantly reduce the time required of operators as a part of the process. The whole process orientation is flipped from being manual labor dependent – complete with such human delays as conflicting priorities, run on meetings, and sick days – to a process where operator intervention is entirely exception based. Going forward, rather than manual monitoring of a file load system, operators are instead notified via an electronic ticket from any number of collaborative software tools available. This kind of automation approach also has the important side benefit of allowing valuable business and IT resources to be repurposed for much more important tasks – tasks that have more of a direct impact on patient and employee well being.<\/p>\r\n\r\n<p>From a technical perspective, automating the file load process can drastically reduce the number of file processing errors by reducing operator intervention. Also, the creation of more robust metadata to define the files took what was information that was housed in people’s heads and placed it in a systems structure, thus reducing organizational risk. Finally, one of the most important technical benefits is that the automation structure provides a place to perform data validation on each and every file, thereby beginning the process of improving any hospital’s data quality quotient over time. That is a non-trivial benefit that pays short and long term dividends for any hospital hoping to improve their data quality for the purpose of implementing an analytics approach to information.<\/p>\r\n\r\n<p>There is one additional benefit worth mentioning. Many hospitals struggle with breaking the cultural barriers of doing things differently. It can be difficult to abandon something that works – even if it is cumbersome – for something that requires less human intervention. Some people will view the automation of formerly manual tasks as a diminishment in the value of the job they perform for the hospital. That, of course, is not true, and the key is to allow people to do things that are more important for, and valued by the hospital. This relatively simple automation process is a great step in that direction and has the potential to significantly improve the validity and integrity of data received from insurance companies. It can also be used as a good teaching moment for hospitals working toward modernization and better data usage and insights: a little automation can go a long way.<\/p>",
        "tags": [
            "data",
            "automation"
        ],
        "nextMindShareId": "emr-data-integration-still-a-long-way-to-go"
    },
	{
        "id": "emr-data-integration-still-a-long-way-to-go",
        "title": "EMR Data Integration: Still a Long Way to Go",
        "authorName": "Bill Sun",
        "authorTitle": "Senior Developer",
        "shortDescription": "For all its benefits - realized and potential - the process of aggregating and consuming EMR information is still problematic at best",
        "isFeatured": false,
        "industry": "healthcare",
        "publishDate": "10/01/2017",
        "readTimeInMinutes": 5,
        "publishName": "HIT Leaders & News",
        "publishUrl": "https://us.hitleaders.news/emr-data-integration-still-a-long-way-to-go/",
        "content": "<p>The advent of Electronic Medical Records (EMR) has been a boon to the operational and analytical abilities of healthcare analytics firms and medical providers, allowing them to more accurately document, track and create the analytics required to better care for patients. Likewise, patients have benefited from the ability to track and monitor their care needs across time, allowing proactive actions to take place when identified and recommended by their healthcare providers. One of the core goals of an EMR-based medical practice is to improve the overall quality of care over time across their particular patient population. This is welcome news all around, but it ultimately entirely depends on the effective and efficient creation, organization, normalization and distribution of medical practice and patient-related data. And that’s where the trouble begins.<\/p>\r\n\r\n<p>For all its benefits—realized and potential—the process of aggregating and consuming EMR (and its offspring the Electronic Health Records or EHR) information is still problematic at best. To date, there is no single technical standard for creating, formatting and distributing EMR data between healthcare analytics firms and EMR vendors. The net result of that is the sub-optimization of the accuracy and usefulness of EMR data. That’s not only an operational issue for healthcare analytics firms but also a serious quality of care issue for patients.<\/p>\r\n\r\n\r\n<p>One of the benefits of EMR data is that it can be converted into insightful and actionable analytic data, both on an individual patient level and on a patient population level. However, the current lack of standards and therefore consistency amongst EMR vendors and healthcare analytics firms continues to be a challenge to producing high-quality analytic information. That means that for most healthcare analytics firms the conversion of EMR data to analytical insights is still a cumbersome one.<\/p>\r\n\r\n<p>Most healthcare analytics firms consume EMR data from multiple vendors in this space. The EMR vendors typically extract and aggregate data from various available sources that they then send to healthcare analytics firms that have contracted with to receive the data on a regular or ad hoc basis. However, the lack of standards by which the EMR vendors create, format and transmit that data makes it very difficult for healthcare analytics firms to consume it efficiently.<\/p>\r\n\r\n<p>For example, things like Continuity of Care Documents (CCD)—a potential valuable data element—are often sent to healthcare analytics firms with missing or incomplete data, or with “standard” data fields in one place from one EMR vendor, and in another place from a different EMR vendor. Also, the data is not usually well edited or normalized, so initial input errors are seldom corrected before the data is redistributed for consumption. This process is further complicated by the fact that EMR vendors each use different transmission methods. Some use a web service approach, others use a file transfer protocol hybrid, while others create proprietary transmission channels. This all adds up to burdensome technical complexity and overhead for any healthcare analytics firm trying to consume the data and turn it into useful analytical insights.<\/p>\r\n\r\n<p>The Clinical Document Architecture (CDA) is one of the ways the industry has tried to achieve standardized data, but to date these efforts have fallen short. For healthcare analytics firms needing to consume this data, that leaves few options. Most use consultants or other technical expertise to create front-end data consumption processes that translate and configure EMR data into something more useful to their data purposes. And there are ways to do that, even as it remains incumbent on healthcare analytics firms and other consumers of the data to do so. From a variety of lessons learned in this area, a few steps stand out as critical.<\/p>\r\n\r\n<p><ul><li>First, with EMR vendors providing data in a number of formats, the practice of data profiling is essential. More often than not there are too many assumptions made on the healthcare analytics firm side about what type of data is being sent and how that data will be formatted. Is it test or live data? Will data be sent via the same channel and in the same format as the last time? Has the data been put into a format that can be used for integration on the healthcare analytics firm end? A good practice is to create a pre-integration process that requires the EMR vendor to send live data samples before any regular transmissions commence. This will go a long way toward ensuring that all of the necessary data elements are included and that the data will be ready for integration when it is received.<\/li>\r\n<li>Second, once the above is in place, an automated routine should be created that addresses any potential integration issues before they reach the data store by categorizing incoming EMR data along a data quality rubric. The quality check should result in the creation of a data feedback report that can be used by healthcare analytics firms and vendors alike to improve their data input and formatting accuracy.<\/li>\r\n<li>Third, any integration process should be built in such a way that it’s flexible enough to handle similar—but not the same—data types from different EMR vendors. For example, CCDs from different EMR vendors can be formatted completely different, even though there is a standard for CCDs. That means it’s critical for healthcare analytics firms to build their integration platforms with as much flexibility as possible to handle the same but different “standard format” of CCDs.<\/li><\/ul><\/p> \r\n\r\n<p>Taken as a whole, these and other similar steps—including the standardization of EMR data distribution channels by EMR vendors—will improve the quality and usability of EMR data for healthcare analytics firms. However, these steps are also an acknowledgment that the data quality problems associated with EMR data are likely to persist into the foreseeable future.<\/p>\r\n\r\n<p>At present, there are not any overriding market, regulatory or operational forces strong enough to motivate EMR vendors, healthcare analytics firms, insurers or any other stakeholders to invest the time and resources necessary to improve things dramatically. Although, a recent effort to improve the accuracy and the quality of EMR data as part of a process to score medical providers’ eligibility for incentives and benefits for the delivery of proactive patient care holds some promise, but it’ll likely be a long time in coming.<\/p>\r\n\r\n<p>In the interim, it remains incumbent on EMR vendors and healthcare analytics firms to put the necessary technologies and associated processes in place to improve the overall quality, integrity and integration of EMR data into their operational analytics.<\/p>",
        "tags": [
            "data",
            "integration"
        ],
        "nextMindShareId": "modern-business-intelligence-for-a-modern-world"
    },
	{
        "id": "modern-business-intelligence-for-a-modern-world",
        "title": "Modern Business Intelligence for a Modern World",
        "authorName": "Zahid Ansari",
        "authorTitle": "Architect",
        "shortDescription": "X by 2’s Zahid Ansari discusses the benefits of moving your BI efforts to the next level via a Modern BI approach.",
        "isFeatured": false,
        "industry": "insurance",
        "publishDate": "11/15/2017",
        "readTimeInMinutes": 5,
        "publishName": "Insurance Innovation Reporter",
        "publishUrl": "http://iireporter.com/modern-business-intelligence-for-a-modern-world/",
        "content": "<q>Modern BI is about business enablement, consumable dashboards, visual data discovery, self-service, leveraging the data capabilities of traditional BI, and producing insightful analytics that are both timely and actionable.<\/q>\r\n\r\n<p>Much like core systems transformations and mobile applications efforts in the insurance industry, the business intelligence trend in the industry is all about putting the customer at the center of the universe. The rapid advent and adoption of what is known as modern business intelligence (BI) and analytics is proof positive of that.  Put simply, the modern BI approach shifts the focus and effort from an IT-centric initiative where reports are produced with complex tools that require specific product knowledge, to a customer centric approach where reports and analysis can be generated quickly by business analysts or others without an IT background. This shift, already well under way, has implications in and across insurance verticals that should allow organizations to more quickly harness and leverage data and information for actionable insights.<\/p>\r\n\r\n<p>Like most industry initiatives, however, conceptualizing modern BI is one thing, while successfully building and using a modern BI platform is quite another.  It’s not a well-kept secret that many insurers have expended copious amounts of time, resources, and money on BI and data initiatives that have not proved successful. The reasons why are many, but a short list that includes poor data organization and quality, complex and expensive tools, competing IT priorities, and soft business sponsorship\/ownership are usually right at the top. These BI efforts have created data fatigue in many insurers, so any modern BI approach must begin with focusing on the ways these traditional risk factors are overcome.<\/p>\r\n\r\n<p>First and foremost, modern BI efforts are business driven and as such are not as dependent on the IT department. The business owns the effort, and commits the resources necessary to make some data inroads. Second, modern BI efforts can be business driven because the tools (such as Tableau and Power BI to name just two) are more intuitive and user friendly. The tools require little to no technical training, and within days (as opposed to months and years) most business analysts can create rudimentary dashboards that can be built upon for insights. Third, since IT supports rather than implements the BI effort, issues like competing IT priorities and long delays for IT generated reports goes away almost overnight. And fourth, since the new tools are agile in nature—favoring quick development and incremental improvements along the way—it naturally leads both the business and IT down the path of working together in a more agile way.<\/p>\r\n\r\n<p>Adopting a modern BI approach still has some challenges. Just as with traditional BI efforts, any successful and effective BI initiative still very much comes down to the data.  No modern BI tool will add any appreciable value to any organization if the data being used is locked in legacy data stores and formats. The good news there is that many insurers have been working on data organization and quality for some years now, and if at this point the data isn’t perfect, it’s still probably in much better shape than it was. Assuming an insurer has made some strides in improving their overall data and information ecosystem, there are some things to keep in mind when transitioning from a traditional BI orientation to a modern BI orientation.<\/p>\r\n\r\n<p>Since a modern BI platform is designed for IT-supported (as opposed to IT-produced) analytic content development, it’s important that the appropriate communications channels and expectations are created between IT and those on the business side who will be developing the analytics. Both sides need to understand their roles and responsibilities clearly, as that will vastly improve the probability for a successful transition from a traditional to modern BI mindset.  One of the keys to the business level usability of modern BI platforms is that they have self-contained architectures. This is what allows business users to execute the full analytic life cycle—from data access to collaborative sharing of insights—and why they are quickly becoming so popular within the business functional areas of insurers.<\/p>\r\n\r\n<p>That said, modern BI platforms do have limitations that this new class of business users needs to keep in mind. Chief among these limitations is scalability. For reporting and visual discovery purposes modern BI tools are providing great value. However, when it comes to advanced analytics where advanced data technology skills and larger amounts of data are needed, there should be an evaluation process to determine whether or not to keep the advanced analytics capabilities within the business function, or move such initiatives to a more centralized technology environment.<\/p>\r\n\r\n<h2>A Way to Leverage Existing Investments<\/h2>\r\n\r\n<p>Adopting a modern BI approach also serves as a way for insurers to leverage some of the investments already expended on the traditional BI and data approach.  One of the frustrations of traditional BI was low user adoption. Since business users couldn’t use the complex tools required and as a result had to request time and effort from IT, many just moved on after a few bad experiences. Now, however, business users can use modern BI tools with little or no training, so there’s an opportunity to rebuild some goodwill while producing actionable and useful analytics.  From a broader operational perspective, modern BI can be used as a way to improve data and analytics governance across an enterprise, by extending the traditional BI governance and data quality processes into the modern BI world.<\/p>\r\n\r\n<p>The point of all of this is that insurers who are serious about their analytics capabilities should take adopting a modern BI approach seriously. Modern BI is about business enablement, consumable dashboards, visual data discovery, self-service, leveraging the data capabilities of traditional BI, and producing insightful analytics that are both timely and actionable. For any insurer interested in leveraging the investments they’ve already made in traditional data and BI initiatives, and in putting the power of insightful data into the hands of their frontline service providers, modern BI is worth a look.<\/p>",
        "tags": [
            "data",
            "business intelligence"
        ],
        "nextMindShareId": "health-information-exchanges-the-future-is-now-for-life-insurers"
    },
	{
        "id": "health-information-exchanges-the-future-is-now-for-life-insurers",
        "title": "Health Information Exchanges: The Future is Now for Life Insurers",
        "authorName": "Yunus Burhani",
        "authorTitle": "Senior Architect",
        "shortDescription": "X by 2’s Yunus Burhani provides some actionable approaches and techniques for automating some key life insurance processes.",
        "isFeatured": false,
        "industry": "insurance",
        "publishDate": "11/30/2017",
        "readTimeInMinutes": 5,
        "publishName": "Becker's Health IT & CIO Review",
        "publishUrl": "https://www.beckershospitalreview.com/healthcare-information-technology/health-information-exchanges-the-future-is-now-for-life-insurers.html",
        "content": "<p>At its core, life insurance underwriting hasn’t changed much. It still involves a complex process to assess an individual’s health and longevity risks. What has changed, and what continues to evolve, are the tools, techniques, and information available to perform such assessments.<\/p>\r\n\r\n<p>An application for a traditional life insurance policy still requires detailed information about any past medical conditions, including any procedures performed, the doctors and hospitals involved, the medications prescribed and taken, etc. However, these applications are often partially or incorrectly completed and submitted because they still rely, at least in part, on the applicant’s memory and forthrightness. It’s not unusual for applicants to have difficulty recalling the specifics of procedures or ailments they may have had five to 10 years ago. And of course, certain coverage\/risk amounts (generally more than $2M) may also require life insurers to get an applicant’s full medical record from any or all of their physicians. These documents are usually provided as a written statement from a physician that then has to be read and interpreted by life insurance underwriters.<\/p>\r\n\r\n<p>In short, it’s still a process that is open to misinterpretations, assumptions, errors and omissions, and at the same time, it lengthens the time it takes to underwrite an insurance policy.<\/p>\r\n\r\n<p>However, advances in the healthcare industry and the formation of the Health Information Exchange (HIE) provide the means to improve the life underwriting process significantly. One of the key advancements in the health industry is the usage of the Electronic Medical Record (EMR). Physicians uniformly use diagnosis and procedure codes to record the condition or ailment, and the procedures performed to address medical ailments and procedures. These codes are also used to create claims for health insurers for payments to physicians. The EMR and claims are then submitted to the HIEs. An HIE typically contains EMRs for patients that are not just from a single patient-physician relationship, but rather from a patient to many other relationships other physicians, hospitals, medical practices and the like. Most HIEs will also have the pharmaceutical records detailing the history of the medications taken by the patient.<\/p>\r\n\r\n<p>Since most any of the exchanges contains vast amounts of data, an AI-approach could be used to mine the required data to determine the existence of any key diseases, illnesses or other issues for underwriting. Life insurers could more reasonably rely on the diagnosis and procedure codes contained in the HIE to determine a more specific medical history for any applicant. Done well, this has the potential to greatly improve the speed and accuracy of the life insurance underwriting process.<\/p>\r\n\r\n<p>Many of the current HIEs are funded by physicians and providers and as such are always struggling to survive on a limited budget. If life insurers started to use this data, it would provide another revenue option for the survival of HIEs making it a win-win solution.<\/p>\r\n\r\n<p>The best way to start using the data in these HIEs would be to leverage evidence vendors who are used by life insurers to provide medical histories using traditional paper-based and in-person methods. One of the services these evidence vendors provide is calling the insureds to ascertain a detailed medical history along with urine and blood tests. Of course, this service is highly dependent on the insureds availability. A better alternative could be first to check the HIE data to see if there is information available for that insured and use it accordingly. This could speed up the process of underwriting considerably.<\/p>\r\n\r\n<p>And for life insurers, such a process could be essential for appealing to a new demographic of life insurance customers. It is clear that the most recent generations—Gen X, Y and Millennial—are less interested in insurance than their parents and grandparents, and part of the reason for that is the onerous process new life insurance applicants must submit to. These generations will not abide by the “old” rules of life insurance underwriting that often includes in-person interviews and in-home medical exams. That is anathema to the sensibilities of these new generations, and they will, apparently, forego life insurance rather than comply with these outdated (in their view) rules.<\/p>\r\n\r\n<p>Instead, these new generations are much more comfortable with non-personal touch for acquiring services of any kind. For life insurers, that means creating services using AI, telematics, automated call and support services, and more robust customer portals and mobile applications.<\/p>\r\n\r\n<p>The wider adoption and use of HIEs is a step in that direction. However for that to occur, life insurers, providers and physicians need to collaborate more effectively, including building a consensus of vision for what and how the HIE ecosystem should evolve. For the life insurance industry, the future really is now.<\/p>",
        "tags": [
            "insurance",
            "automation"
        ],
        "nextMindShareId": "building-great-technical-solutions-requires-more-than-technical-prowess"
    },
	{
        "id": "building-great-technical-solutions-requires-more-than-technical-prowess",
        "title": "Building Great Technical Solutions Requires More Than Technical Prowess",
        "authorName": "Hatim Kader",
        "authorTitle": "Project Quarterback",
        "shortDescription": "In this era of hyper-competitiveness, businesses are increasingly looking at leveraging technology for that added edge or the distinguishing factor that sets them apart from their competition.  In this article, X by 2's Hatim Kader argues that the underlying key to success is the right balance of understanding the business needs and applying the right technological solution to meet or exceed those needs.  To strike the right balance, IT project managers must sharpen their emotional intelligence (EQ) skills.",
        "isFeatured": false,
        "industry": "insurance",
        "publishDate": "09/01/2017",
        "readTimeInMinutes": 3,
        "publishName": "Health Information & Technology",
        "publishUrl": "https://www.beckershospitalreview.com/healthcare-information-technology/building-great-technical-solutions-requires-more-than-technical-prowess.html",
        "content": "<p>In this era of hyper-competitiveness, businesses are increasingly looking at leveraging technology for that added edge or the distinguishing factor that sets them apart from their competition.<\/p>\r\n\r\n<p>Be it an innovative use of population health analytics by a health insurer or a care provider, or the use of artificial intelligence by the auto industry, in every sphere technological breakthroughs are shaping or creating new business opportunities.<\/p>\r\n\r\n<p>In all these shiny examples, the underlying key to success is the right balance of understanding the business needs and applying the right technological solution to meet or exceed those needs. This underlying factor applies to every business and technology customer interface. Whether it is the development of that bleeding-edge application that creates new models such as autonomous driving or the routine application of technological improvements to any business's operational systems, such as modernizing an insurer's claims system. No matter the initiative, achieving this balance requires that the business and technologists can communicate with each other and comprehend each other.<\/p>\r\n\r\n<p>However, more often than not, challenges emerge because of the interfacing parties - i.e., business and technologists - may not be speaking a common language. It's not that IT practitioners are not aware of such language barriers, yet it's still very easy to miss the signs when such barriers start emerging in interactions between IT and business stakeholders. For example, it's easy to imagine an IT practitioner using the word \"metadata\" in his\/her communication with the end-user or customer, and not realizing that even that concept could be very foreign to someone in their audience. This may lead to the parties ending up disconnected, and eventually impacting the effectiveness of that excellent technology in solving the end customer's critical business need.<\/p>\r\n\r\n<p>So how do you deal with this situation? The key is to step into their shoes, to grasp the view from their vantage point as a way to tailor the interactions appropriately.<\/p>\r\n\r\n<p>A non-IT example can help illustrate this point. Imagine you are a person with no prior experience with law enforcement or the judicial system, and you are sitting in a courtroom as a first-time juror. You are listening to \"opening statements,” and the \"prosecutor\" calling upon witnesses. There is also a \"defense counsel\" interjecting with phrases like \"objection,” \"hearsay, and not admissible.\" The judge is also using some technical language to \"overrule\" or \"sustain\" something the attorneys have said, and you find yourself sometimes struggling to understand the proceedings fully. You may wonder why these fine people - the judge, the prosecutor and the defense attorney - need your help to decide this case, and yet they are not helping themselves by making it easy for you to grasp the proceedings effectively. Why can't they use common sense language? What do they mean by \"hearsay,\" and why is it \"not admissible?”<\/p>\r\n\r\n<p>Well, that's precisely how the business people might feel in their interactions with IT practitioners where the IT practitioner - an accomplished individual - may be presenting an elegant solution and explaining it using common industry technical terminologies. However, the business people may not be able to connect with everything being presented, and thereby are not able to partner effectively in the development or application of that just-right solution.<\/p>\r\n\r\n<p>Of course, it would be beneficial if all the stakeholders were equally tech-savvy, as in the case that a juror may be familiar with the law, or the judicial system, or law enforcement terms more generally. But that does not always happen, and here the IT practitioner needs to make that effort in ensuring they first comprehend the business audience – try to see the world from their vantage point – and communicates using simple and commonly understandable language – language that would be readily comprehensible by that business audience.<\/p>\r\n\r\n<p>This is not “dumbing” down anything; instead, it’s assimilating the business's perspective to see it through the same lenses. We used an example here to illustrate how the use of technical jargon by some or the lack of understanding of technical jargon by others, can impair outcomes. But the point is not just about using terminologies appropriately or simplification of communication only, preferably it is about pursuing effectiveness of technical solutions and creating positive impacts on the business, which requires business and IT to team up effectively and that in turn requires them to fully and completely understand each other.<\/p>\r\n\r\n<p>The key to all of the above is to employ skills that will allow one to see and understand something from another's perspective. Things like listening deeply and attentively, having an honest and open dialogue without preconceived notions of what an outcome should be, understanding that the other person's ideas opinions are just as important to them as yours are to you, and yes, even exercising a little empathy towards the other party when and where appropriate.<\/p>\r\n\r\n<p>In a nutshell, we are talking about emotional intelligence or EQ. “Your EQ is the level of your ability to understand other people, what motivates them and how to work cooperatively with them” as stated by the noted Harvard theorist Howard Gardner.<\/p>\r\n\r\n<p>IT practitioners usually possess good IQs, but they must also nurture and mature EQ skills that are required to understand better, empathize and communicate or negotiate with their business customers. These skills need to be employed in all interactions between IT and business customers, be it simple conversations, or moderating sessions to discuss end-user needs, or presenting solutions or results.<\/p>\r\n\r\n<p>People do possess some or all of these skill sets at varying degrees, but don’t always excel in them – especially in the IT realm – and it takes commitment and practice to master and wield them effectively. But done well, blending and leveraging EQ and IQ prowess will lead to bonding (in a workplace context), which leads to trust, which fosters better communication and understanding, and eventually manifests into the development of an effective solution that provides significant positive impact to the business. Now that sounds like it's worth the practice to perfect.<\/p>",
        "tags": [
            "insurance",
            "technology"
        ],
        "nextMindShareId": "a-moneyball-approach-to-insurance-it-recruiting"
    },	
	{
        "id": "a-moneyball-approach-to-insurance-it-recruiting",
        "title": "A 'Moneyball' Approach to Insurance IT Recruiting",
        "authorName": "Jeff Sallans",
        "authorTitle": "Senior Consultant",
        "shortDescription": "Among the many challenges facing the insurance industry, none might be more critical—and problematic—than finding and keeping strong technical talent.  So what’s the answer? In part, it's focusing on the assessment process as a way to find talent that others might overlook by measuring skill—real and potential—over experience. And much like the popular baseball book and movie Moneyball, the key to better assessing talent and outcomes is to know the right questions to ask.  In this article X by 2’s Jeff Sallans discusses a better way to assess technical talent.",
        "isFeatured": false,
        "industry": "insurance",
        "publishDate": "01/02/2018",
        "readTimeInMinutes": 5,
        "publishName": "DigitalInsurance",
        "publishUrl": "https://www.dig-in.com/opinion/a-moneyball-approach-to-insurance-it-recruiting?brief=00000159-faf0-d111-af7d-fbfd9f0a0000",
        "content": "<p>Among the many challenges facing the insurance industry, none might be more critical—and problematic—than finding and keeping strong technical talent. And this is not a new problem. It has slowly but surely been creeping up on the industry for decades, as technology companies, the lure of startups and the industry’s reputation for living behind the technology curve have all created disincentives for young technical talent to take a look at the industry.<\/p>\r\n\r\n<p>So what’s the answer? In part, it's focusing on the assessment process as a way to find talent that others might overlook by measuring skill—real and potential—over experience. And much like the popular baseball book and movie <i>Moneyball<\/i>, the key to better assessing talent and outcomes is to know the right questions to ask.<\/p>\r\n\r\n<p><ul>This <i>Moneyball<\/i> approach promises several benefits:\r\n<li>First, it could provide the industry with an influx of strong IT talent that could help to move technology capabilities forward.<\/li>\r\n<li>Second, it could—over time—improve the quality of systems and processes in the industry, leading to better customer service overall and improved profitability.<\/li>\r\n<li>Third, it could enhance the efficiency of IT departments as they become restocked with fewer but more capable people.<\/li>\r\n<li>Fourth, it could start to break the perception of the industry as a backwater for technology innovation.<\/li><\/ul><\/p>\r\n\r\n<p>The key to accomplishing all of this is by improving the way in which technical talent is assessed. However, asking the right questions is something that seems easy, but actually isn’t. It can only be learned through the bitter experience of asking many of the wrong questions, which leads to bad hires.<\/p>\r\n\r\n<p>One of the keys to asking the right questions is to ask the questions that would likely arise while somebody was working in that position. To get a holistic view of the experiences and potential of each candidate, the interview questions should be organized into three categories that align with the desired position.<\/p>\r\n\r\n\r\n<p>In the following examples, the positions used are an IT developer, a technical lead, or a junior architect. Through the above-mentioned trial and error, the question categories that have been developed over time for the interview include technical skills, previous successes\/failures and soft skills.<\/p>\r\n\r\n<h2>Technical skills<\/h2>\r\n\r\n<p>The assessment objective behind the Technical Skills category is to determine with some reasonableness of certainty that the candidate is or will be capable of developing quality software within a large project scope. Therefore, the specific questions will not focus on knowing <i>this<\/i> language or <i>that<\/i> configuration tool, but rather on a thoroughness of understanding of best practice coding patterns, testing, and integration techniques, and designing software for scalability and maintainability.<\/p>\r\n\r\n<p>This approach generally leads to an insightful dialog and avoids simply checking yes and no boxes for specific skills. The focus is on the long-term probability of success for any given interviewee. The analogy to the <i>Moneyball<\/i> approach is that this qualitative approach is trying to get at how an interviewee will perform over a full season, given enough at-bats, pitching starts or other applicable metrics.<\/p>\r\n\r\n<h2>Previous success\/failures<\/h2>\r\n\r\n<p>This approach is continued for the two other main categories of the interview. For the Previous Success\/Failures category, the whole point here is that evaluating somebody based upon their experiences to date and extrapolating their development into some future point is usually a better success indicator than evaluating somebody on the specific skills listed on their resume.<\/p>\r\n\r\n<p>So the questions in this category focus on asking the candidate to tell a particular project story from their experience, why they thought it turned out the way it did, what they might do differently next time, and what they learned from the experience. This is a good opportunity to have the candidate use a whiteboard or some other medium that allows them to illustrate and elaborate. There are great insights in this category for a candidate’s thinking and logic process, the technical and operational complexity of their experiences, and their organizational and communication skills.<\/p>\r\n\r\n<h2>Soft skills<\/h2>\r\n\r\n<p>For the final category, the previous discussion on the candidate’s experiences can be used as input to evaluate their Soft Skills. Asking questions that center on <i>why<\/i> something works the way it does, or <i>why<\/i> certain decisions were made, are much more valuable than questions about <i>how<\/i> something works.<\/p>\r\n\r\n<p>For example, answering the question of how to maintain software over time is a very different answer than why it's important to do so. Answering the why question leads to broader thinking about the value of software to a company, its relation to operational processes in the business, etc. There are no real right or wrong answers, and it again becomes an opportunity to have a conversation about a variety of things. The focus is mainly on communications, and the goal is to ascertain a candidate's ability to:<\/p>\r\n\r\n<p><ul><li>Understand technical conversations<\/li>\r\n<li>Meaningfully contribute to technical conversations<\/li>\r\n<li>Summarize the technical details for others<\/li>\r\n<li>Participate in overall team dynamics<\/li><\/ul><\/p>\r\n\r\n<p>The premise posited here is that the insurance industry has a technical talent issue and that the suggested approach herein is one way to begin to address that issue. This approach is of course only one way, and other approaches may be equally effective.<\/p>\r\n\r\n<p>The larger point is that the industry's overall approach to talent assessment needs to get better, and not just by a little bit. The consequences of not doing so are problematic and would leave the industry exposed to continuous innovation and technology deficit as compared to other sectors. That's why the industry needs to be proactive rather than reactive about talent assessment, and judging someone on their current skills even if they haven't had the experience to prove them out entirely is one way to do that. As the statistical analyst opined to his baseball general manager boss in <i>Moneyball<\/i>: \"Your goal shouldn't be to buy players. Your goal should be to buy wins. To buy wins, you need to buy runs.\" We need to score more runs.<\/p>",
        "tags": [
            "insurance",
            "recruiting"
        ],
        "nextMindShareId": "if-its-not-mobile-dont-bother"
    },
	{
        "id": "if-its-not-mobile-dont-bother",
        "title": "If It's Not Mobile, Don't Bother",
        "authorName": "Tyler Sullivan",
        "authorTitle": "Marketing Consultant",
        "shortDescription": "A plethora of articles have been written on how the insurance industry should engage with younger generations of potential customers. Whether millennial, Gen X or Y or anything in-between, the industry has rightly recognized a shift in the research and buying patterns of younger consumers.  In this article X by 2 author and millennial Tyler Sullivan has some suggestions for the industry as it tries to reposition itself as a marketplace for this all important demographic. ",
        "isFeatured": false,
        "industry": "insurance",
        "publishDate": "01/04/2018",
        "readTimeInMinutes": 5,
        "publishName": "Insurance-Canada",
        "publishUrl": "https://www.insurance-canada.ca/2018/01/04/not-mobile-dont-bother/",
        "content": "<p>A plethora of articles have been written on how the insurance industry should engage with younger generations of potential customers. Whether millennial, Gen X or Y or anything in-between, the industry has rightly recognized a shift in the research and buying patterns of younger consumers. As a millennial, this change has everything to do with growing up as near digital natives and thus having a different kind of relationship with technology and time than prior generations might have had. For most of the millennial generation then, that means that if it’s not possible to use a mobile device to manage a relationship with an insurer, then we’d just as soon move on, thank you very much.<\/p>\r\n\r\n<p>Now before devolving into stereotypical clichés about what a millennial may or may not want, and why or why not that may be, it’s important to understand that just like every prior generation, the millennial generation has their way of relating to the world around them. Objectively speaking, those ways are neither good nor bad; they’re just the way the millennial perspective has evolved. So let’s get specific. My generation has grown up in a world where researching and purchasing things (meals, books, cars, houses) can be accomplished online exclusively via mobile devices.  It should come as a shock to exactly nobody in the insurance industry that the same expectation for researching and purchasing would hold true for insurance. However, since that is not entirely possible at this point, it should also come as no surprise that most millennials tend to just skip the whole insurance thing, at least for now. This is due to many other influences as well, but online accessibility and ease of access remain the key prohibitors in millennials actively seeking insurance. That said, there is an opportunity here. As the millennial generation gets on with their lives, insurers who develop viable mobile interfaces along with targeted products and services can reap the financial rewards of selling into the most prominent demographic since the baby boomers. That’s no small opportunity, and it should be one that insurers are stepping all over themselves to leverage.<\/p>\r\n\r\n<p>One way that the insurance industry might leverage that opportunity is to make investments now to begin to turn themselves into digital businesses. That doesn’t mean that they won’t have buildings or offices, but it does mean that they’ll take a digital\/mobile-first approach to their next generations of customers.<\/p>\r\n\r\n<p>For those insurers who are interested in going down this road, here are the basic millennial requirements:<\/p>\r\n\r\n<p><ul>\r\n<li>Researching and purchasing insurance happens online and can be completed in full by the customer.<\/li>\r\n<li>Any subsequent amendments, alterations or customizations happen online with text chat to answer any questions.<\/li>\r\n<li>Claim reporting happens online in real-time, with AI and robotic technologies to assist.<\/li>\r\n<li>Through the whole process, self-research and text chatting with a live person on the other end are fine, but wasting time on unproductive and inefficient phone calls should never be required.<\/li><\/ul><\/p>\r\n<p>This, of course, is a major change for the industry. But from a millennial perspective, is this a bigger change than what the retail, music, book, or countless other industries have gone through? Or should millennials infer that the insurance industry is just less interested in having them as customers than other industries are? Yes, it is all a matter perspective. For the millennial generation, technology exists to make life – and everything that’s part of it – easier and more manageable. If a given technology, or industry, doesn’t achieve that then millennials are loath to have anything to do with it unless absolutely necessary, and even then grudgingly.<\/p>\r\n\r\n<p>And for the millennial generation—and this is important to the insurance industry—technology is directly related to time. What does that mean? That means that the millennial generation has a relationship with time—managing it, wasting it, accumulating it—that is quite different from prior generations. The millennial generation has grown up in an era of high-speed networking, social technologies, and for better or worse, near instant gratification. This means that any technology or service that can save us time is a technology or service that we want in our lives. Yes, this is part of the clichéd list of complaints that our parents and grandparents have of this generation, along with every kid gets a trophy, etc. However, that’s how we were wired, and that’s no different in the abstract than our parent’s generation being wired for rock and roll and protests, and our grandparent’s generation being wired for the greatest generation and suburban bliss. It’s just part of the millennial experience set, and the insurance industry would be well advised to recognize it and make plans to deal with it sooner rather than later.<\/p>\r\n\r\n<p>So no thank you. The millennial generation is not interested in waiting on hold to report a claim, or waiting for days for an insurance policy or product to be completed, or filling out seemingly endless and redundant forms only to be told that our information can’t be located by the branch office, or to have a nurse come into our home for an intrusive exam for a life insurance application. Like electricity, this generation will flow to the paths of least resistance and will look for other ways to get the insurance type products needed – hello Insurtech startups – rather than dealing with an industry that doesn’t care to understand our needs. The demographic reality is that the millennial generation will need insurance products as it starts businesses and families, and purchases homes and cars. The demand will be there, so the supply just needs to get aligned in a way that is more palatable and consumable for the millennial generation.<\/p>\r\n\r\n<p>So drop us a text insurance industry, and let us know how you’re doing. Oh wait, your old system can’t text—we have a problem.<\/p>",
        "tags": [
            "insurance",
            "mobile"
        ],
        "nextMindShareId": "how-providers-can-get-better-results-from-data-efforts"
    },
     {
        "id": "how-providers-can-get-better-results-from-data-efforts",
        "title": "How Providers Can Get Better Results From Data Efforts",
        "authorName": "Mohammed Hussain",
        "authorTitle": "Senior Developer",
        "shortDescription": "In this article, X by 2's Mohammed Hussain offers some actionable suggestions for getting the most out of the creation of health data analytics.  ",
        "isFeatured": false,
        "industry": "healthcare",
        "publishDate": "02/12/2018",
        "readTimeInMinutes": 5,
        "publishName": "HealthData Management",
        "publishUrl": "https://www.healthdatamanagement.com/opinion/how-providers-can-get-better-results-from-analytics-and-data-warehouses",
        "content": "<p>The primacy of information to the healthcare industry over the last several years has seen project successes and failures, as health insurers and other health stakeholders race to develop ways to extract actionable information from their data stores.<\/p>\r\n\r\n<p>While healthcare data and analytics holds promise to bring increased effectiveness and efficiency to the industry, the route to achieving the things that these analytics promise—proactive healthcare, better customer service, process improvements, better claims modeling, increased profitability and more—has been littered with failed attempts. That begs the question of whether there is an approach to healthcare data and analytics that offers some reasonable hope of success.<\/p>\r\n\r\n<p>Through trial and error, a successful pattern for implementing analytics solutions has emerged that is centered around conferring closely with the business customer. By having business analysts and data scientists actually coding their own solutions and employing IT just to standardize, optimize, scale and automate those solutions, there is a correspondingly much higher success rate in delivering those solutions. The idea behind this was and is—because the business had built the original prototype, regardless of how inelegant it may have been, they had a clear understanding of what they should be expecting.<\/p>\r\n\r\n<p>To examine this approach more closely, let’s suppose there are two different tracks of work that were conducted in widely different ways by two different teams. Each track was defined by business and developed by IT, but one was successfully implemented by IT, and the other track was plagued with bugs and ultimately shelved by business pending further analysis.<\/p>\r\n\r\n<p>Briefly going through each track in a simple retrospective and outlining the best practices around how to conduct and coordinate projects between IT and business should illustrate the difference in approaches, and therefore the difference in potential success. The focus here is on healthcare data and analytics and how IT can help facilitate actionable analytics in a continuous delivery and reporting cycle.<\/p>\r\n\r\n<p>Let’s explore two short contrasting case studies that outline how this suggested approach could be applied and its benefits:<\/p>\r\n\r\n<h2>Person matching<\/h2>\r\n<p>The project goal was to develop a master person index using the conformance layer of an Enterprise Data Warehouse project. The driver and business case for the project was to have all outgoing extracts use the same person matching logic to generate data, in the current state (at the time) each individual extract had its own custom matching algorithm and the development of a new track required re-coding this matching in each component.<\/p>\r\n\r\n<p>There were two primary functional requirements. The existing extracts must use this new generic matching logic, and any new system or process must be able to easily integrate with this matched person data.<\/p>\r\n\r\n<p>For non-functional requirements, The major consideration in architecting a solution was to ensure that the core logic of the matching algorithm was easily modifiable so that the algorithm could be refined over time as more was learned on how to properly match disparate person records.<\/p>\r\n\r\n<p>The end status of this work track was that it did not pass acceptance testing. The final product was shelved pending an analysis by the business. In the analysis of this project, there were several lessons learned, but the core issues were that the business resources did not have enough involvement in the design process, and IT did not push enough for that involvement.<\/p>\r\n\r\n<p>The business resources had essentially outlined the problem domain and requested that IT provide a solution, and IT complied by doing an analysis, determining an architecture and developing a solution. The problem was that the business resources had no clear idea (aside from design artifacts) as to what the final deliverable should look like. And because the analytics team could not conceptualize the solution well, the integration was never fully accepted, and the business shelved the project awaiting further research and development.<\/p>\r\n\r\n<p>This track of work only spanned a single sprint before it was pushed back to planning and leadership, but the retrospective results challenged IT’s ability to work properly with the business. It was clear that a change in approach would be required for the next project.<\/p>\r\n\r\n<h2>Dimensional model<\/h2>\r\n<p>The analytics team wanted a dimensional model built out of the conformed data in the enterprise data warehouse. The final result should be a framework on which dimensions and fact tables can be quickly modeled and then moved to production. The primary use case was to build Claims and Membership facts across over 16 dimensions.<\/p>\r\n\r\n<p>The functional requirements of the project was that the solution would be business defined fact tables and their associated dimension tables. For non-functional requirements, the design must support new business needs. New facts and dimensions that are identified should be easily added to the existing integration.<\/p>\r\n\r\n<p>The end result of this work track was successful Quality Assurance (QA) and User Acceptance Testing (UAT) and a limited launch to the analytics team for a “beta acceptance.” Additional facts and dimensions were added in the following months as the data scientist performed further discovery.<\/p>\r\n\r\n<p>This track of work followed a different requirements gathering phase. This need was communicated upfront to the business resources assigned to ensure more participation and accountability for the systems that were being built by IT. The business analyst assigned to this work was responsible for creating drafts of the data models and coding the final expected output for each fact and dimension. The models were then refined by the architect and technical leads, and the developers had a business-built and accepted model along with the expected output to test against.<\/p>\r\n\r\n<p>Another success factor was limiting the number of high impact decisions. There were still issues and redesigns done during the development and QA phases, but the overall design stayed the same, and the solution was delivered to the business on time and met their expectations.<\/p>\r\n\r\n<p>This method of providing requirements and defining the final results so that IT can set proper expectations was ultimately successful. Developers are very good at (and primarily responsible) for delivering well-structured and performing solutions to business problems, but often lack the proper intuitions to dissect and disseminate the business problem thoroughly.<\/p>\r\n\r\n<p>Of course, business involvement in a development process is not a new concept—the Agile methodology actually encourages and depends on this—leading to a modus operandi designed to increase business involvement to remove a lot of the guesswork that IT tends to do in these situations.<\/p>\r\n\r\n<p>While not foolproof, the suggested approach significantly increased the likelihood of project success. The business analysts intuitively knew how the data should be queried and used and what the output should look like. Once they provided that to IT, all the assumptions and guesswork was eliminated, and IT could focus on the things it does best by preparing the new dimensional model for production. This should serve as a sharp reminder that the best business technology outcomes happen when business and IT resources find the right way to work together.<\/p>",
        "tags": [
            "provider",
            "data"
        ],
        "nextMindShareId": "software-development-is-like-toilet-training"
    }, 
    {
        "id": "software-development-is-like-toilet-training",
        "title": "Software Development Is Like Toilet Training",
        "authorName": "David Mitzel",
        "authorImageUrl": "david-mitzel.png",
        "authorFullImageUrl": "david-mitzel-full.png",
        "authorTitle": "Architect & Senior Developer",
        "shortDescription": "As I've helped my 2-year-old daughter through the first couple stages of toilet training, it occured to me that sometimes software development is a similiar process.",
        "isFeatured": true,
        "industry": "insurance",
        "publishDate": "09/02/2017",
        "readTimeInMinutes": 5,
        "publishName": "Health Information & Technology",
        "publishUrl": "https://drive.google.com/file/d/0B7xJHW88i3NWb1BTLTU5WmNWNnM/view",
        "content": "<p>As I’ve helped my 2-year-old daughter through the first couple stages of toilet training, it occurred to me that sometimes software development is a similar process. Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur.<\/p><hr \/><q>Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor.<\/q><hr \/><p>Veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.<\/p>",
        "tags": [
            "agile",
            "implementation"
        ],
        "nextMindShareId": "software-development-is-like-toilet-training-2h"
    },
    {
        "id": "software-development-is-like-toilet-training-2h",
        "title": "Software Development Is Like Toilet Training 2h",
        "authorName": "David Mitzel",
        "authorImageUrl": "david-mitzel.png",
        "authorFullImageUrl": "david-mitzel-full.png",
        "authorTitle": "Architect & Senior Developer",
        "shortDescription": "As I've helped my 2-year-old daughter through the first couple stages of toilet training, it occured to me that sometimes software development is a similiar process.",
        "isFeatured": false,
        "industry": "healthcare",
        "publishDate": "09/01/2017",
        "readTimeInMinutes": 3,
        "publishName": "Health Information & Technology",
        "publishUrl": "https://drive.google.com/file/d/0B7xJHW88i3NWb1BTLTU5WmNWNnM/view",
        "content": "<p>As I’ve helped my 2-year-old daughter through the first couple stages of toilet training, it occurred to me that sometimes software development is a similar process. Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur.<\/p><hr \/><q>Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor.<\/q><hr \/><p>Veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.<\/p>",
        "tags": [
            "agile",
            "implementation"
        ],
        "nextMindShareId": "software-development-is-like-toilet-training-3i"
    },
    {
        "id": "software-development-is-like-toilet-training-3i",
        "title": "Software Development Is Like Toilet Training 3i",
        "authorName": "David Mitzel",
        "authorImageUrl": "david-mitzel.png",
        "authorFullImageUrl": "david-mitzel-full.png",
        "authorTitle": "Architect & Senior Developer",
        "shortDescription": "As I've helped my 2-year-old daughter through the first couple stages of toilet training, it occured to me that sometimes software development is a similiar process.",
        "isFeatured": false,
        "industry": "insurance",
        "publishDate": "09/02/2017",
        "readTimeInMinutes": 5,
        "publishName": "Health Information & Technology",
        "publishUrl": "https://drive.google.com/file/d/0B7xJHW88i3NWb1BTLTU5WmNWNnM/view",
        "content": "<p>As I’ve helped my 2-year-old daughter through the first couple stages of toilet training, it occurred to me that sometimes software development is a similar process. Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur.<\/p><hr \/><q>Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor.<\/q><hr \/><p>Veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.<\/p>",
        "tags": [
            "agile",
            "implementation"
        ],
        "nextMindShareId": "software-development-is-like-toilet-training-4h"
    },
    {
        "id": "software-development-is-like-toilet-training-4h",
        "title": "Software Development Is Like Toilet Training 4h",
        "authorName": "David Mitzel",
        "authorImageUrl": "david-mitzel.png",
        "authorFullImageUrl": "david-mitzel-full.png",
        "authorTitle": "Architect & Senior Developer",
        "shortDescription": "As I've helped my 2-year-old daughter through the first couple stages of toilet training, it occured to me that sometimes software development is a similiar process.",
        "isFeatured": false,
        "industry": "healthcare",
        "publishDate": "09/02/2017",
        "readTimeInMinutes": 5,
        "publishName": "Health Information & Technology",
        "publishUrl": "https://drive.google.com/file/d/0B7xJHW88i3NWb1BTLTU5WmNWNnM/view",
        "content": "<p>As I’ve helped my 2-year-old daughter through the first couple stages of toilet training, it occurred to me that sometimes software development is a similar process. Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur.<\/p><hr \/><q>Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor.<\/q><hr \/><p>Veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.<\/p>",
        "tags": [
            "agile",
            "implementation"
        ],
        "nextMindShareId": "software-development-is-like-toilet-training-5i"
    },
    {
        "id": "software-development-is-like-toilet-training-5i",
        "title": "Software Development Is Like Toilet Training 5i",
        "authorName": "David Mitzel",
        "authorImageUrl": "david-mitzel.png",
        "authorFullImageUrl": "david-mitzel-full.png",
        "authorTitle": "Architect & Senior Developer",
        "shortDescription": "As I've helped my 2-year-old daughter through the first couple stages of toilet training, it occured to me that sometimes software development is a similiar process.",
        "isFeatured": false,
        "industry": "insurance",
        "publishDate": "09/02/2017",
        "readTimeInMinutes": 5,
        "publishName": "Health Information & Technology",
        "publishUrl": "https://drive.google.com/file/d/0B7xJHW88i3NWb1BTLTU5WmNWNnM/view",
        "content": "<p>As I’ve helped my 2-year-old daughter through the first couple stages of toilet training, it occurred to me that sometimes software development is a similar process. Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur.<\/p><hr \/><q>Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor.<\/q><hr \/><p>Veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.<\/p>",
        "tags": [
            "agile",
            "implementation"
        ],
        "nextMindShareId": "software-development-is-like-toilet-training-6h"
    },
    {
        "id": "software-development-is-like-toilet-training-6h",
        "title": "Software Development Is Like Toilet Training 6h",
        "authorName": "David Mitzel",
        "authorImageUrl": "david-mitzel.png",
        "authorFullImageUrl": "david-mitzel-full.png",
        "authorTitle": "Architect & Senior Developer",
        "shortDescription": "As I've helped my 2-year-old daughter through the first couple stages of toilet training, it occured to me that sometimes software development is a similiar process.",
        "isFeatured": false,
        "industry": "healthcare",
        "publishDate": "09/02/2017",
        "readTimeInMinutes": 5,
        "publishName": "Health Information & Technology",
        "publishUrl": "https://drive.google.com/file/d/0B7xJHW88i3NWb1BTLTU5WmNWNnM/view",
        "content": "<p>As I’ve helped my 2-year-old daughter through the first couple stages of toilet training, it occurred to me that sometimes software development is a similar process. Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur.<\/p><hr \/><q>Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor.<\/q><hr \/><p>Veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.<\/p>",
        "tags": [
            "agile",
            "implementation"
        ],
        "nextMindShareId": "software-development-is-like-toilet-training-7i"
    },
    {
        "id": "software-development-is-like-toilet-training-7i",
        "title": "Software Development Is Like Toilet Training 7i",
        "authorName": "David Mitzel",
        "authorImageUrl": "david-mitzel.png",
        "authorFullImageUrl": "david-mitzel-full.png",
        "authorTitle": "Architect & Senior Developer",
        "shortDescription": "As I've helped my 2-year-old daughter through the first couple stages of toilet training, it occured to me that sometimes software development is a similiar process.",
        "isFeatured": false,
        "industry": "insurance",
        "publishDate": "09/02/2017",
        "readTimeInMinutes": 5,
        "publishName": "Health Information & Technology",
        "publishUrl": "https://drive.google.com/file/d/0B7xJHW88i3NWb1BTLTU5WmNWNnM/view",
        "content": "<p>As I’ve helped my 2-year-old daughter through the first couple stages of toilet training, it occurred to me that sometimes software development is a similar process. Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur.<\/p><hr \/><q>Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor.<\/q><hr \/><p>Veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.<\/p>",
        "tags": [
            "agile",
            "implementation"
        ],
        "nextMindShareId": "software-development-is-like-toilet-training-8h"
    },
    {
        "id": "software-development-is-like-toilet-training-8h",
        "title": "Software Development Is Like Toilet Training 8h",
        "authorName": "David Mitzel",
        "authorImageUrl": "david-mitzel.png",
        "authorFullImageUrl": "david-mitzel-full.png",
        "authorTitle": "Architect & Senior Developer",
        "shortDescription": "As I've helped my 2-year-old daughter through the first couple stages of toilet training, it occured to me that sometimes software development is a similiar process.",
        "isFeatured": false,
        "industry": "healthcare",
        "publishDate": "09/02/2017",
        "readTimeInMinutes": 5,
        "publishName": "Health Information & Technology",
        "publishUrl": "https://drive.google.com/file/d/0B7xJHW88i3NWb1BTLTU5WmNWNnM/view",
        "content": "<p>As I’ve helped my 2-year-old daughter through the first couple stages of toilet training, it occurred to me that sometimes software development is a similar process. Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur.<\/p><hr \/><q>Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor.<\/q><hr \/><p>Veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.<\/p>",
        "tags": [
            "agile",
            "implementation"
        ],
        "nextMindShareId": "software-development-is-like-toilet-training-9i"
    },
    {
        "id": "software-development-is-like-toilet-training-9i",
        "title": "Software Development Is Like Toilet Training 9i",
        "authorName": "David Mitzel",
        "authorImageUrl": "david-mitzel.png",
        "authorFullImageUrl": "david-mitzel-full.png",
        "authorTitle": "Architect & Senior Developer",
        "shortDescription": "As I've helped my 2-year-old daughter through the first couple stages of toilet training, it occured to me that sometimes software development is a similiar process.",
        "isFeatured": false,
        "industry": "insurance",
        "publishDate": "09/02/2017",
        "readTimeInMinutes": 5,
        "publishName": "Health Information & Technology",
        "publishUrl": "https://drive.google.com/file/d/0B7xJHW88i3NWb1BTLTU5WmNWNnM/view",
        "content": "<p>As I’ve helped my 2-year-old daughter through the first couple stages of toilet training, it occurred to me that sometimes software development is a similar process. Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur.<\/p><hr \/><q>Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor.<\/q><hr \/><p>Veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.<\/p>",
        "tags": [
            "agile",
            "implementation"
        ]
    }
]